In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
 "date":pd.date_range('20130102', periods=6),
  "city":['Beijing ', '  SH        7               ', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
 "age":[23,44,54,32,34,32],
 "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
  "price":[1200,np.nan,2133,5433,np.nan,4432]},
  columns =['id','date','city','category','age','price'])

1,df

(1,
      id       date                          city category  age   price
 0  1001 2013-01-02                      Beijing     100-A   23  1200.0
 1  1002 2013-01-03    SH        7                   100-B   44     NaN
 2  1003 2013-01-04                    guangzhou     110-A   54  2133.0
 3  1004 2013-01-05                      Shenzhen    110-C   32  5433.0
 4  1005 2013-01-06                      shanghai    210-A   34     NaN
 5  1006 2013-01-07                      BEIJING     130-F   32  4432.0)

In [2]:
df.fillna(value=0)

     id       date                          city category  age   price
0  1001 2013-01-02                      Beijing     100-A   23  1200.0
1  1002 2013-01-03    SH        7                   100-B   44     0.0
2  1003 2013-01-04                    guangzhou     110-A   54  2133.0
3  1004 2013-01-05                      Shenzhen    110-C   32  5433.0
4  1005 2013-01-06                      shanghai    210-A   34     0.0
5  1006 2013-01-07                      BEIJING     130-F   32  4432.0

In [48]:
df['price'].fillna(df['price'].mean()),df['price']#

(0    1200.0
 1    3299.5
 2    2133.0
 3    5433.0
 4    3299.5
 5    4432.0
 Name: price, dtype: float64,
 0    1200.0
 1       NaN
 2    2133.0
 3    5433.0
 4       NaN
 5    4432.0
 Name: price, dtype: float64)

In [49]:
df.isnull()

      id   date   city  category    age  price
0  False  False  False     False  False  False
1  False  False  False     False  False   True
2  False  False  False     False  False  False
3  False  False  False     False  False  False
4  False  False  False     False  False   True
5  False  False  False     False  False  False

In [50]:
df['price'].fillna(df['price'].mean())

0    1200.0
1    3299.5
2    2133.0
3    5433.0
4    3299.5
5    4432.0
Name: price, dtype: float64

In [51]:
df['price']

0    1200.0
1       NaN
2    2133.0
3    5433.0
4       NaN
5    4432.0
Name: price, dtype: float64

In [52]:
df['city']=df['city'].map(str.strip)

In [53]:
df.rename(columns={'category' :'category-size'})

     id       date         city category-size  age   price
0  1001 2013-01-02      Beijing         100-A   23  1200.0
1  1002 2013-01-03  SH        7         100-B   44     NaN
2  1003 2013-01-04    guangzhou         110-A   54  2133.0
3  1004 2013-01-05     Shenzhen         110-C   32  5433.0
4  1005 2013-01-06     shanghai         210-A   34     NaN
5  1006 2013-01-07      BEIJING         130-F   32  4432.0

In [58]:
df['price'].drop_duplicates(),df['price']

(0    1200.0
 1       NaN
 2    2133.0
 3    5433.0
 5    4432.0
 Name: price, dtype: float64,
 0    1200.0
 1       NaN
 2    2133.0
 3    5433.0
 4       NaN
 5    4432.0
 Name: price, dtype: float64)

In [56]:
df['city'].drop_duplicates()

0        Beijing
1    SH        7
2      guangzhou
3       Shenzhen
4       shanghai
5        BEIJING
Name: city, dtype: object

In [3]:
np.array(df['city'].drop_duplicates(keep= 'last'))

array(['Beijing ', '  SH        7               ', ' guangzhou ',
       'Shenzhen', 'shanghai', 'BEIJING '], dtype=object)

In [4]:
df['city']=df['city'].str.lower()

In [5]:
df['city']=df['city'].str.lower()

In [6]:
df

     id       date                          city category  age   price
0  1001 2013-01-02                      beijing     100-A   23  1200.0
1  1002 2013-01-03    sh        7                   100-B   44     NaN
2  1003 2013-01-04                    guangzhou     110-A   54  2133.0
3  1004 2013-01-05                      shenzhen    110-C   32  5433.0
4  1005 2013-01-06                      shanghai    210-A   34     NaN
5  1006 2013-01-07                      beijing     130-F   32  4432.0

In [7]:
df['city'].drop_duplicates(keep= 'last')

1      sh        7
2                      guangzhou
3                        shenzhen
4                        shanghai
5                        beijing
Name: city, dtype: object

In [8]:
df.loc[3]

id                         1004
date        2013-01-05 00:00:00
city                   shenzhen
category                  110-C
age                          32
price                      5433
Name: 3, dtype: object

In [70]:
df ['group'] = np.where(df ['price'] > 3000,'high','low')

In [18]:
df

     id       date       city category  age   price group
0  1001 2013-01-02    beijing    100-A   23  1200.0   low
1  1002 2013-01-03         sh    100-B   44     NaN   low
2  1003 2013-01-04  guangzhou    110-A   54  2133.0   low
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  high
4  1005 2013-01-06   shanghai    210-A   34     NaN   low
5  1006 2013-01-07    beijing    130-F   32  4432.0  high

In [71]:
df.iloc[0:-2]

     id       date                          city category  age   price group
0  1001 2013-01-02                      beijing     100-A   23  1200.0   low
1  1002 2013-01-03    sh        7                   100-B   44     NaN   low
2  1003 2013-01-04                    guangzhou     110-A   54  2133.0   low
3  1004 2013-01-05                      shenzhen    110-C   32  5433.0  high

In [72]:
df.reset_index()
df=df.set_index('date')

In [73]:
df[:'2013-01-04']

              id                          city category  age   price group
date
2013-01-02  1001                      beijing     100-A   23  1200.0   low
2013-01-03  1002    sh        7                   100-B   44     NaN   low
2013-01-04  1003                    guangzhou     110-A   54  2133.0   low

In [22]:
df.groupby('city')['price'].agg([len,np.sum, np.mean])

           len     sum    mean
city
beijing    2.0  5632.0  2816.0
guangzhou  1.0  2133.0  2133.0
sh         1.0     0.0     NaN
shanghai   1.0     0.0     NaN
shenzhen   1.0  5433.0  5433.0

In [23]:
import seaborn as sns

In [74]:
df

              id                          city category  age   price group
date
2013-01-02  1001                      beijing     100-A   23  1200.0   low
2013-01-03  1002    sh        7                   100-B   44     NaN   low
2013-01-04  1003                    guangzhou     110-A   54  2133.0   low
2013-01-05  1004                      shenzhen    110-C   32  5433.0  high
2013-01-06  1005                      shanghai    210-A   34     NaN   low
2013-01-07  1006                      beijing     130-F   32  4432.0  high

In [75]:
df['price'].corr(df['age'])

-0.08689525836897034

In [76]:
df.cov()

                id          age         price
id        3.500000    -0.700000  3.243333e+03
age      -0.700000   118.300000 -2.255833e+03
price  3243.333333 -2255.833333  3.867667e+06

In [77]:
df.corr()

             id       age     price
id     1.000000 -0.034401  0.792239
age   -0.034401  1.000000 -0.086895
price  0.792239 -0.086895  1.000000

In [78]:
import numpy as np
import pandas as pd

df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
 "date":pd.date_range('20130102', periods=6),
  "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
 "age":[23,44,54,32,34,32],
 "category":['A','B','A','C','A','F'],
  "price":[1200,np.nan,2133,5433,np.nan,4432]},
  columns =['id','date','city','category','age','price'])
df

     id       date         city category  age   price
0  1001 2013-01-02     Beijing         A   23  1200.0
1  1002 2013-01-03           SH        B   44     NaN
2  1003 2013-01-04   guangzhou         A   54  2133.0
3  1004 2013-01-05     Shenzhen        C   32  5433.0
4  1005 2013-01-06     shanghai        A   34     NaN
5  1006 2013-01-07     BEIJING         F   32  4432.0

In [29]:
df.groupby('category')['price'].agg([len])

          len
category
A         3.0
B         1.0
C         1.0
F         1.0

In [139]:
import numpy as np
a=df.groupby('category')['price'].agg([len])+1
a

          len
category
A         4.0
B         2.0
C         2.0
F         2.0

In [140]:
a.info

<bound method DataFrame.info of           len
category
A         4.0
B         2.0
C         2.0
F         2.0>

In [1]:
a.sum

NameError: name 'a' is not defined

In [1]:
import matplotlib
import numpy as np
import matplotlib.pyplot as plt
x=['A','B','C','F']
print(a.len)
plt.bar(x, a.len, align =  'center') 
plt.title('Bar graph') 
plt.ylabel('Number') 
plt.xlabel('category') 
plt.show()

NameError: name 'a' is not defined

In [143]:
from sklearn.datasets import load_iris
iris_data = load_iris()
iris = pd.DataFrame(iris_data['data'], columns=iris_data['feature_names'])
iris = pd.merge(iris, pd.DataFrame(iris_data['target'], columns=['species']), left_index=True, right_index=True)
labels = dict(zip([0,1,2], iris_data['target_names']))
iris['species'] = iris['species'].apply(lambda x: labels[x])